*** Validating the linear model of ECOFEN
- For validating ECOFEN, the experiment found in section E (Per-Byte Total Energy) in this paper
 [[http://ieeexplore.ieee.org/document/5928833/][Profiling per-packet and per-byte energy consumption in the NetFPGA Gigabit router]] is used
- In this paper, depicted on Figure 6 there are four linear energy models that are obtained from actual measurements. 
- Here is the procedure followed to (in)validate the linear model implemented in ECOFEN using these four models
  - Setup an experiment under the same condition as specified in the paper, the following table shows the parameters used
  
    | Parameters                          |               Values |
    |-------------------------------------+----------------------|
    | Packets per second (in thousands)   |       20, 60, 40, 80 |
    | Packet size (header + payload)      | 100, 576, 1300, 1500 |
    | Simulation time (in seconds)        |                    1 |
    | Idle power consumption  (watts)     |               10.242 |
    | Per-Byte power consumption (nJoule) |                3.212 |
   
    Note: the NetFPGA router with three ports turned on, the idle power consumption is ~10.242 this value is used in the linear
           model of ECOFEN as the chassis consumption of a node. No idle power consumption is used for the Net devices or the 
           ports, since they are already accounted for in the chassis consumption. 
  - Write a script which output the average power consumption value for the ECOFEN's linear model
  - In the same script compute and display the expected power consumption value   
  - Compute the difference and compare the result
- This script  [[file:ns3/link_energy3.cc]] is used for the experiment. The extracted output of the experiment is shown in the 
  table below
 #+tblname: validation 
  | NumberOfPackets | PacketSize | SimulatedPower | ExpectedPower | Difference |
  |-----------------+------------+----------------+---------------+------------|
  |           20000 |        100 |        10.2551 |       10.2578 |    -2.7e-3 |
  |           20000 |        576 |        10.3163 |       10.2916 |     0.0247 |
  |           20000 |       1300 |        10.4093 |        10.343 |     0.0663 |
  |           20000 |       1500 |         10.435 |       10.3572 |     0.0778 |
  |           40000 |        100 |        10.2682 |       10.2681 |       1e-4 |
  |           40000 |        576 |        10.3905 |       10.3335 |      0.057 |
  |           40000 |       1300 |        10.5766 |       10.4331 |     0.1435 |
  |           40000 |       1500 |        10.6279 |       10.4606 |     0.1673 |
  |           60000 |        100 |        10.2813 |       10.2882 |    -6.9e-3 |
  |           60000 |        576 |        10.4648 |       10.3796 |     0.0852 |
  |           60000 |       1300 |        10.7438 |       10.5186 |     0.2252 |
  |           60000 |       1500 |        10.8209 |        10.557 |     0.2639 |
  |           80000 |        100 |        10.2944 |       10.2764 |      0.018 |
  |           80000 |        576 |         10.539 |       10.4098 |     0.1292 |
  |           80000 |       1300 |        10.9111 |       10.6128 |     0.2983 |
  |           80000 |       1500 |        11.0139 |       10.6688 |     0.3451 |
#+TBLFM: $5=$3-$4
- In the script the inter-packet interval is computed by dividing 1 second by the number of packets
